app/Controllers/auth/AuthController.php

    public function loginProcess()
    {
        //membaca validasi input
        $rules = [
            'login_id' => 'required',
            'password' => 'required',
        ];
        //kalau validasinya gagal dia akan kembali ke halaman login
        if (!$this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }


        $loginId  = $this->request->getPost('login_id');
        $password = $this->request->getPost('password');

        // Cek apakah input berupa email atau nama
        if (filter_var($loginId, FILTER_VALIDATE_EMAIL)) {
            $user = $this->userModel->where('email', $loginId)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'superadmin@gmail.com'
 LIMIT 1