app/Controllers/controlpanel/superAdmin/GeoJsonController.php

    public function index()
    {
        // mengambil semua data geojson dari model GeoJsonModel
        $data['geojson'] = $this->geoJsonModel->findAll();
---
SELECT *
FROM `geojson`