app/Controllers/controlpanel/superAdmin/SekolahController.php

SELECT *
FROM `sekolah`
---
    public function index()
    {
        $data['sekolah'] = $this->SekolahModel->findAll();

SELECT *
FROM `sekolah`
WHERE `sekolah`.`id` = '113'
SELECT *
FROM `geojson`
---
    public function edit($id)
    {
        $data['sekolah'] = $this->SekolahModel->find($id);
        $data['geojson'] = (new GeoJsonModel())->findAll();

SELECT *
FROM `sekolah`
WHERE `sekolah`.`id` = '113'
---
    public function update($id)
    {
        $sekolah = $this->SekolahModel->find($id);

SELECT *
FROM `geojson`
WHERE `geojson`.`id` = '10'
UPDATE `sekolah` SET `nama_sekolah` = 'psdku tanah datar', `tingkatan` = 'TK', `akreditasi` = 'B', `npsn` = '10302416', `nomor_sekolah` = '0752777591', `email` = NULL, `visi` = 'ads', `misi` = 'asda', `website` = NULL, `alamat` = 'asdasd', `latitude` = '-0.47340000', `longitude` = '100.77801291', `geojson_id` = '10', `kecamatan` = 'Lintau Buo', `foto` = '1782894050_bf864fe76b04d1406e9b.png', `updated_at` = '2026-07-01 08:20:50'
WHERE `sekolah`.`id` IN ('113')
---
        }

        $geojsonId = $this->request->getPost('geojson_id');
        $geo       = (new GeoJsonModel())->find($geojsonId);

        $this->SekolahModel->update($id, [
            'nama_sekolah'  => $this->request->getPost('nama_sekolah'),
            'tingkatan'     => $this->request->getPost('tingkatan'),
            'akreditasi'    => $this->request->getPost('akreditasi') ?: null,
            'npsn'          => $this->request->getPost('npsn') ?: null,
            'nomor_sekolah' => $this->request->getPost('nomor_sekolah') ?: null,
            'email'         => $this->request->getPost('email') ?: null,
            'visi'          => $this->request->getPost('visi') ?: null,
            'misi'          => $this->request->getPost('misi') ?: null,
            'website'       => $this->request->getPost('website') ?: null,
            'alamat'        => $this->request->getPost('alamat'),
            'latitude'      => $this->request->getPost('latitude'),
            'longitude'     => $this->request->getPost('longitude'),
            'geojson_id'    => $geojsonId,
            'kecamatan'     => $geo['nama_kecamatan'] ?? null,
            'foto'          => $fotoName,
        ]);