app/Controllers/controlpanel/superAdmin/UserController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $users = $this->userModel->findAll();