app/Controllers/controlpanel/admin/LaporanController.php

SELECT DISTINCT `kecamatan`
FROM `sekolah`
ORDER BY `kecamatan` ASC
SELECT *
FROM `sekolah`
ORDER BY `nama_sekolah` ASC
SELECT COUNT(*) AS `numrows`
FROM `geojson`
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `tingkatan` = 'TK'
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `tingkatan` = 'SD'
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `tingkatan` = 'SMP'
---
    public function index()
    {
        $kecamatan = $this->sekolahModel
            ->select('kecamatan')
            ->distinct()
            ->orderBy('kecamatan', 'ASC')
            ->findAll();

        $sekolah = $this->sekolahModel
            ->orderBy('nama_sekolah', 'ASC')
            ->findAll();

        $totalGeoJson = (new \App\Models\GeoJsonModel())->countAllResults();
        $totalTK      = $this->sekolahModel->where('tingkatan', 'TK')->countAllResults();
        $totalSD      = $this->sekolahModel->where('tingkatan', 'SD')->countAllResults();
        $totalSMP     = $this->sekolahModel->where('tingkatan', 'SMP')->countAllResults();