app/Controllers/controlpanel/admin/SekolahController.php

    public function index()
    {
        $data['sekolah'] = $this->SekolahModel->findAll();
---
SELECT *
FROM `sekolah`