app/Controllers/controlpanel/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `sekolah`
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `tingkatan` = 'TK'
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `tingkatan` = 'SD'
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `tingkatan` = 'SMP'
SELECT COUNT(*) AS `numrows`
FROM `geojson`
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `kecamatan`
FROM `sekolah`
) CI_count_all_results
SELECT *
FROM `sekolah`
SELECT *
FROM `geojson`
SELECT `kecamatan`, COUNT(*) as total
FROM `sekolah`
GROUP BY `kecamatan`
ORDER BY `total` DESC
---
    public function index()
    {


        $sekolahModel = new \App\Models\SekolahModel();
        $geoJsonModel = new \App\Models\GeoJsonModel();
        $userModel    = new \App\Models\UserModel();

        $data['totalSekolah']  = $sekolahModel->countAllResults();
        $data['totalTK']       = $sekolahModel->where('tingkatan', 'TK')->countAllResults();
        $data['totalSD']       = $sekolahModel->where('tingkatan', 'SD')->countAllResults();
        $data['totalSMP']      = $sekolahModel->where('tingkatan', 'SMP')->countAllResults();
        $data['totalGeoJson']  = $geoJsonModel->countAllResults();
        $data['totalAkun']     = $userModel->countAllResults();
        $data['totalKecamatan'] = $sekolahModel->select('kecamatan')->distinct()->countAllResults();

        $data['sekolah'] = $sekolahModel->findAll();
        $data['geojson'] = $geoJsonModel->findAll();

        $data['sekolahPerKecamatan'] = $sekolahModel
            ->select('kecamatan, COUNT(*) as total')
            ->groupBy('kecamatan')
            ->orderBy('total', 'DESC')
            ->findAll();