app/Controllers/controlpanel/MapsController.php

    public function index()
    {
        $data['sekolah'] = (new \App\Models\SekolahModel())->findAll();
        $data['geojson'] = (new \App\Models\GeoJsonModel())->findAll();
---
SELECT *
FROM `sekolah`
SELECT *
FROM `geojson`