app/Controllers/Home.php

SELECT *
FROM `sekolah`
SELECT *
FROM `geojson`
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `tingkatan` = 'TK'
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `tingkatan` = 'SD'
SELECT COUNT(*) AS `numrows`
FROM `sekolah`
WHERE `tingkatan` = 'SMP'
---
    public function index()
    {
        $sekolahModel = new SekolahModel();
        $geoJsonModel = new GeoJsonModel();

        $data['sekolah'] = $sekolahModel->findAll();
        $data['geojson'] = $geoJsonModel->findAll();

        $data['totalSekolah'] = $sekolahModel->countAllResults();
        $data['totalTK']      = $sekolahModel->where('tingkatan', 'TK')->countAllResults();
        $data['totalSD']      = $sekolahModel->where('tingkatan', 'SD')->countAllResults();
        $data['totalSMP']     = $sekolahModel->where('tingkatan', 'SMP')->countAllResults();

SELECT *
FROM `sekolah`
SELECT *
FROM `geojson`
---
    public function petaFull()
    {
        $sekolahModel = new \App\Models\SekolahModel();
        $geoJsonModel = new \App\Models\GeoJsonModel();

        $data['sekolah'] = $sekolahModel->findAll();
        $data['geojson'] = $geoJsonModel->findAll();

SELECT *
FROM `sekolah`
WHERE `sekolah`.`id` = '113'
---
    public function sekolahDetail($id)
    {
        $sekolahModel = new \App\Models\SekolahModel();
        $sekolah      = $sekolahModel->find($id);