app/Controllers/controlpanel/operatorSekolah/LokasiController.php

SELECT *
FROM `sekolah`
WHERE `sekolah`.`id` = '114'
---
    public function index()
    {
        $sekolahId = session()->get('sekolah_id');

        if (!$sekolahId) {
            return redirect()->to('/login')->with('error', 'Sesi sekolah tidak ditemukan, silakan login ulang.');
        }

        $data['sekolah'] = $this->sekolahModel->find($sekolahId);