app/Controllers/controlpanel/operatorSekolah/SekolahController.php

SELECT *
FROM `sekolah`
WHERE `sekolah`.`id` = '114'
SELECT *
FROM `geojson`
---
    public function index()
    {
        //mengambil data sekolah berdasarkan id sekolah yang tersimpan di session
        $sekolahId = session()->get('sekolah_id');

        if (!$sekolahId) {
            return redirect()->to('/login')->with('error', 'Sesi sekolah tidak ditemukan, silakan login ulang.');
        }

        $data['sekolah'] = $this->sekolahModel->find($sekolahId);

        if (!$data['sekolah']) {
            return redirect()->to('/login')->with('error', 'Data sekolah tidak ditemukan.');
        }

        $data['geojson'] = (new GeoJsonModel())->findAll();

SELECT *
FROM `sekolah`
WHERE `sekolah`.`id` = '114'
SELECT *
FROM `geojson`
---
    public function edit()
    {
        //mengambil data sekolah berdasarkan id sekolah yang tersimpan di session
        $id = session()->get('sekolah_id');

        // Pastikan operator cuma bisa mengedit sekolahnya sendiri
        if (!$id) {
            return redirect()->to('/login')->with('error', 'Sesi sekolah tidak ditemukan, silakan login ulang.');
        }

        $data['sekolah'] = $this->sekolahModel->find($id);

        if (!$data['sekolah']) {
            return redirect()->to('admin/profileSekolah')->with('error', 'Data sekolah tidak ditemukan');
        }

        $data['geojson'] = (new GeoJsonModel())->findAll();